Repository: khasanyusupkhujaev/arXiv_paper_summarizer
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: Введите ID статьи (например, 2506.08872)
uz: Maqola ID'sini kiriting (masalan, 2506.08872)

source: ID статьи
uz: Maqola ID'si

source: Find an Article
uz: Maqolani izlash

source: Describe the article you want
uz: Sizga kerakli maqolani tavsiflang

source: E.g., Articles about Artificial General Intelligence (AGI)
uz: Masalan, Sun’iy umumiy intellekt haqidagi maqolalar

source: Например, 2506.08872
uz: Masalan, 2506.08872

source: Search Instructions
uz: Qidiruv ko‘rsatmalari

source: Describe the topic in detail for accurate results. E.g., instead of 'Reinforcement Learning', write 'Uncertainty Prioritized Experience Replay for dynamic environments'.
uz: Aniq natijalar olish uchun mavzuni batafsil tavsiflang. Masalan, ’Reinforcement Learning’ o‘rniga ’Uncertainty Prioritized Experience Replay for dynamic environments'.

source: Use specific keywords that reflect the problem, methodology, or context of the article you’re searching for.
uz: Qidirilayotgan maqolaning muammosi, metodologiyasi yoki kontekstini aks ettiruvchi maxsus kalit so‘zlardan foydalaning.

source: If you want to limit the search to a category (e.g., computer science), include it in the description.
uz: Agar qidiruvni turkum bilan cheklamoqchi bo‘lsangiz (masalan, informatika), uni tavsifga kiriting.

source: Use clear and specific terms, avoiding vague words, to improve result relevance.
uz: Natijaning dolzarbligini oshirish uchun noaniq so‘zlardan qochib, aniq va ravshan atamalardan foydalaning.

source: Не удалось найти статью с ID {paper_id} на {repository}.
uz: {repository} ID {paper_id} uchun maqola topilmadi

source: Вы загрузили статью:
uz: Quyidagi maqola yuklandi:

source: Теперь вы можете суммировать её или задать вопросы.
uz: Endi siz uni umumlashtirishingiz yoki savollar berishingiz mumkin.

source: Что это означает в простых терминах?
uz: Oddiyroq qilib aytganda, bu nimani anglatadi?

source: Приведите пример этого
uz: Bunga misol keltiring

source: Searching...
uz: Izlash...

source: Почему это важно?
uz: Bu nima uchun muhim?

source: Суммаризация статьи
uz: Maqolani umumlashtirish

source: Полученное резюме:
uz: Olingan rezyume:

source: Введите вопрос или выделите текст и нажмите 'Получить ответ.
uz: Savol kiriting yoki matnni belgilang va "Javob olish" tugmasini bosing.

source: Суммирование...
uz: Umumlashtirish...

source: Загрузить другую статью
uz: Boshqa maqola yuklash

source: Задайте вопрос по статье:
uz: Maqola bo‘yicha savol bering:

source: Введите ваш вопрос здесь...
uz: Savolingizni bu yerga kiriting...

source: Статья обработан успешно!
uz: Maqola muvaffaqiyatli qayta ishlandi!

source: Язык:
uz: Til:

source: Обработка статьи Arxiv
uz: Arxiv maqolasini qayta ishlash

source: Идет обработка, пожалуйста, подождите...
uz: Qayta ishlash jarayoni davom etmoqda, iltimos, kuting...

source: Этапы обработки:
uz: Qayta ishlash bosqichlari:

source: Поиск статьи на Arxiv и загрузка PDF...
uz: Arxivda maqola qidirilmoqda va PDF yuklanmoqda...

source: Извлечение текста из PDF...
uz: PDF'dan matn ajratilmoqda...

source: Генерация резюме...
uz: Xulosa yaratilmoqda...

source: Обработка завершена. Перенаправление...
uz: Qayta ishlash tugallandi. Yo‘naltirilmoqda...

source: Обработать статью
uz: Maqolaini qayta ishlash

source: Обработать и суммировать
uz: Qayta ishlash va umumlashtirish

source: Вид суммаризации
uz: Umumlashtirish turi

source: Короткий
uz: Qisqa

source: Стандартный
uz: Standart

source: Подробный
uz: Batafsil

source: Поиск статьи...
uz: Maqola izlanmoqda...

source: Название:
uz: Maqola sarlavhasi:

source: Авторы:
uz: Mualliflar:

source: Репозиторий
uz: Repozitoriy

source: Результаты поиска
uz: Qidiruv natijalari

source: Поиск по запросу:
uz: So‘rov bo‘yicha qidirish:

source: Аннотация:
uz: Annotatsiya:

source: Using English for search is the best practice
uz: Qidiruv uchun ingliz tilidan foydalanish eng yaxshi amaliyotdir

source: Не удалось найти название статьи.
uz: Maqola sarlavhasi topilmadi.

source: Ошибка при поиске статьи. Проверьте ID.
uz: Maqola qidirishda xato yuz berdi. ID’ni tekshiring.

source: Обработка...
uz: Qayta ishlash

source: Обработать Arxiv ID
uz: Arxiv ID’ni qayta ishlash

source: Обработка статьи
uz: Maqolani qayta ishlash

source: Статья загружена из кэша!
uz: Maqola keshdan yuklandi!

source: Суммировать
uz: Qayta ishlash

source: Статья обработана успешно!
uz: Maqola muvaffaqiyatli qayta ishlandi!

source: Название статьи:
uz: Maqola sarlavhasi:

source: Теперь вы можете получить резюме или задать вопросы.
uz: Endi siz xulosa olishingiz yoki savollar berishingiz mumkin.

source: Резюме статьи
uz: Maqola xulosasi

source: Получите краткое изложение основных положений статьи.
uz: Maqolaning asosiy qoidalari haqida qisqa ma'lumot oling.

source: Получить резюме
uz: Xulosa olish

source: Сгенерированное резюме:
uz: Yaratilgan xulosa:

source: Нажмите 'Получить резюме', чтобы сгенерировать краткое изложение.
uz: Qisqa ma'lumotni yaratish uchun 'Xulosa olish' tugmasini bosing.

source: Задать вопрос
uz: Savol berish

source: Задайте вопрос на основе содержимого статьи или выделите текст в резюме.
uz: Maqola mazmuni asosida savol bering yoki rezyumeda matnni ajratib ko‘rsating.

source: Получить ответ
uz: Javob olish

source: Ответ:
uz: Javob:

source: Введите вопрос и нажмите 'Получить ответ'.
uz: Savol kiriting va 'Javob olish' tugmasini bosing.

source: Обработать другую статью
uz: Boshqa maqolani qayta ishlash

source: Поиск ответа...
uz: Javob izlanmoqda...

source: Получение ответа...
uz: Javob olish...

source: Неизвестное название
uz: Noma'lum sarlavha

source: Неизвестные авторы
uz: Noma'lum mualliflar

source: ID Arxiv не предоставлен.
uz: Arxiv ID taqdim etilmadi.

source: Не удалось найти статью с таким ID.
uz: Bunday ID bilan maqola topilmadi.

source: Неизвестная статья
uz: Noma'lum maqola

source: Не удалось загрузить PDF с Arxiv ID: {arxiv_id}. Проверьте ID или соединение.
uz: Arxiv ID: {arxiv_id} bilan PDF yuklab bo‘lmadi. ID’ni yoki ulanishni tekshiring.

source: Не удалось извлечь текст из PDF. Пожалуйста, проверьте файл или его формат.
uz: PDF'dan matnni ajratib bo‘lmadi. Iltimos, faylni yoki uning formatini tekshiring.

source: Произошла неизвестная ошибка при обработке статьи.
uz: Maqolani qayta ishlashda noma'lum xato yuz berdi.

source: Не удалось найти текст или вопрос для ответа.
uz: Javob berish uchun matn yoki savol topilmadi.

source: Ошибка извлечения текста из PDF: {error}
uz: PDF'dan matn ajratib olishda xato: {error}

source: Summary not available in this language.
uz: Ushbu tilda qisqacha ma'lumot mavjud emas.

source: Не удалось загрузить оригинальный PDF: {error}
uz: Asl PDF ni yuklab olish amalga oshmadi: {error}

source: Выберите вид суммаризации:
uz: Umumlashtirish turini tanlang

source: Title
uz: Sarlavha

source: Authors
uz: Mualliflar

source: Generated Summary
uz: Yaratilgan qisqacha ma'lumot

source: No Title Available
uz: Sarlavha mavjud emas

source: No Authors Available
uz: Mualliflar mavjud emas

source: Original Paper URL:
uz: Asl maqola URL manzili:

source: Информация о статье
uz: Maqola haqida ma'lumot

source: Заголовок:
uz: Sarlavha:

source: Недоступно
uz: Mavjud emas

source: Оригинальный URL статьи:
uz: Asl maqola URL manzili:

source: Загрузки
uz: Yuklamalar

source: Скачать резюме (PDF)
uz: Qisqacha ma'lumotni yuklab olish (PDF)

source: Скачать оригинал статьи (PDF)
uz: Asl maqolani yuklab olish (PDF)
